cf_billing/Documents/энргУстановитьДатуПоверкиПУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьДатуПоверкиПУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргДатыПоверкиПрибораУчета</xr:Item>
				<xr:Item>InformationRegister.энргПриборыУчетаСИстекшимСрокомПоверки</xr:Item>
				<xr:Item>InformationRegister.энргСостояниеВыполненияОбязанностейГарантирующегоПоставщика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>160</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоверкиСчетчика</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредыдущейПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиВывод</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Флаг</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОчереднойПоверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредоставлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргДатыПоверкиПрибораУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДатыПоверкиПрибораУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/энргУстановитьДатуПоверкиПУ/Forms/ФормаДокументаИндивидуальныйВвод/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргУстановитьДатуПоверкиПУ(ЭтотОбъект);
		
	ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(Объект.КлючПомещения);
			ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
		КонецЕсли;
		
		ЗаполнитьДокумент  = Ложь;
		
		Если Параметры.Свойство("ЗаполнитьДокумент") тогда
			Если Параметры.ЗаполнитьДокумент тогда
				ЗаполнитьДокумент = истина;
			КонецЕсли;
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Объект.КлючПомещения) и ЗаполнитьДокумент тогда
			ТочкаУчета = Неопределено;
			Параметры.ЗначенияЗаполнения.Свойство("ТочкаУчета", ТочкаУчета);
			Если не ЗначениеЗаполнено(Объект.Дата) тогда
				Объект.Дата 	= ТекущаяДата();
			КонецЕсли;			
			ЗаполнитьПриборыУчетаСервер(, ТочкаУчета);
		КонецЕсли; 		
	КонецЕсли;		
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
		
	// Настройка доступности в зависимости от прав
	СписокЭлементов = Новый Структура("Строение, Помещение");
	энргОбщегоНазначения.УстановитьДоступностьЭлементовПоРолям(ЭтаФорма, СписокЭлементов, Метаданные.Документы.энргУстановитьДатуПоверкиПУ);
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ДанныеПомещенияРезультат 	= Обработки.энргКлючиПомещенийМенеджер.РезультатДанныеПомещенияПоКлючу(ТекущийОбъект.КлючПомещения);
	ЗаполнитьДанныеКлючаПомещения(ДанныеПомещенияРезультат);
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
КонецПроцедуры 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда		
		ПроверитьЗаполнениеДанных(Отказ);		
	КонецЕсли;
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
	энргШкалыТарифныеЗоныСервер.ПроверитьПоказанияНаКорректностьВвода(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// энргРаботаСПоследовательностями.ВосстановитьПоследовательностьПоАбоненту(Объект.Организация, Объект.ПериодНачисления,Объект.Район,ЧастныйСектор,Строение,Помещение,Объект.Абонент);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);

КонецПроцедуры

#Конецобласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ПроверитьЗаполнениеДанных(Отказ)
	Если Объект.ВидОперации = Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС Тогда
		СтруктураОбязательныхРеквизитов = Новый Структура;
		ПолучитьСтруктуруОбязательныхРеквизитов(СтруктураОбязательныхРеквизитов);
		СтруктураОбязательныхТЧ = Новый Структура;
	    ПолучитьМассивТЧ(СтруктураОбязательныхТЧ);
		
		Для каждого стр из СтруктураОбязательныхРеквизитов Цикл
			Если Не ЗначениеЗаполнено(стр.Значение) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено значение реквизита '" + стр.Ключ +"'");
				Отказ = Истина;		
			КонецЕсли;
		КонецЦикла;
		
		Для каждого стр из СтруктураОбязательныхТЧ Цикл
			Если стр.Значение.Количество() = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена ТЧ '" + стр.Ключ +"'");
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтруктуруОбязательныхРеквизитов(Структура)
	Структура.Вставить("Организация", 	Объект.Организация);	
	Структура.Вставить("Район", 		Объект.Район);
	Структура.Вставить("Строение", 		Строение);
	Структура.Вставить("Помещение", 	Помещение);
КонецПроцедуры

&НаСервере
Процедура ПолучитьМассивТЧ(Структура)
	Структура.Вставить("Услуги",				Объект.ТочкиУчета);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);		
	КонецЕсли;
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		
		Объект.ТочкиУчета.Очистить();
	КонецЕсли;  	
	ЗаполнитьПриборыУчетаСервер();	
КонецПроцедуры

&НаКлиенте
Процедура АбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка 	= ложь;	
	//Отбор					= Новый Структура();
	////ПараметрыВыбора  		= Новый Структура();
	//Отбор.Вставить("Район",Объект.Район);
	//Если ЗначениеЗаполнено(Объект.МКД) тогда
	//	Отбор.Вставить("Дом",Объект.МКД);
	//КонецЕсли;   	 
	//ПараметрыВыбора.Вставить("Отбор",Отбор);
	//ОткрытьФорму("Справочник.энргАбоненты.ФормаВыбора",ПараметрыВыбора,Элемент);
	
	// ОТЭК, 27.05.2020, 000204429.	
	//Объект.МКД = ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	//энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент,Объект.Организация,Объект.Район,Объект.МКД,СтандартнаяОбработка);	
	энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент, Объект.Организация, Объект.Район,,
															СтандартнаяОбработка, Новый Структура("Строение,Состояние", Строение,Истина));
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;	
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)	
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент, Новый Структура("ТочкиСПриборами", Истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриИзменении(Элемент)
	
	ТекущаяСтрока 				= Элементы["ТочкиУчета" + ПрефиксТочекУчета].ТекущаяСтрока;
	ЗаполнитьПриборыУчетаСервер(ТекущаяСтрока);
		
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки			= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки, Неопределено, "ТочкиУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки			= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНетШкалНетТарифныхЗон

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьПриборыУчетаСервер();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтроку(ДополнительныеПараметры)
	Объект[ДополнительныеПараметры.ТЧ].Удалить(ДополнительныеПараметры.НомерСтроки);	
КонецПроцедуры

&НаСервере
Процедура РайонПриИзмененииНаСервере()
	Объект.Организация = Объект.Район.Организация;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	РайонПриИзмененииНаСервере();
		
	// ОТЭК, 28.05.2020, 000204429.
	энргПользовательскийВводКлиент.отэкРайонПриИзменении(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПриборУчетаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТочкиУчета.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ПриборУчета) Тогда
		ПолучитьДатуПредыдущейПоверкиПУНаСервере(ТекущиеДанные.ПриборУчета); 
	Иначе
		ТекущиеДанные.ДатаПредыдущейПоверки = Дата(1,1,1);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьДатуПредыдущейПоверкиПУНаСервере(ПриборУчета = Неопределено)
	
	Разделитель = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	энргУстановитьДатуПоверкиПУТочкиУчета.НомерСтроки КАК НомерСтроки,
	|	энргУстановитьДатуПоверкиПУТочкиУчета.КлючПомещения КАК КлючПомещения,
	|	энргУстановитьДатуПоверкиПУТочкиУчета.ПриборУчета КАК ПриборУчета
	|ПОМЕСТИТЬ ВведенныеПриборыДействующихТочек
	|ИЗ
	|	&ТочкиУчета КАК энргУстановитьДатуПоверкиПУТочкиУчета" 
	
	+ Разделитель + РегистрыСведений.энргДатыПоверкиПрибораУчета.ТекстЗапросаДатыПоверокДействующихПриборовУчета() + Разделитель;
	 	
	Текст = Текст + 
	"ВЫБРАТЬ
	|	ВведенныеПриборыДействующихТочек.НомерСтроки КАК НомерСтроки,
	|	ДатыПоверокДействующихПриборовУчета.ДатаПоверки КАК ДатаПредыдущейПоверки
	|ИЗ
	|	ВведенныеПриборыДействующихТочек КАК ВведенныеПриборыДействующихТочек
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыПоверокДействующихПриборовУчета КАК ДатыПоверокДействующихПриборовУчета
	|		ПО ВведенныеПриборыДействующихТочек.ПриборУчета = ДатыПоверокДействующихПриборовУчета.ПриборУчета";
	
	
	Запрос = Новый Запрос(Текст);
	
	Запрос.УстановитьПараметр("Период"		, Новый Граница(Объект.Дата, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
	Запрос.УстановитьПараметр("Район"		, Объект.Район);
	Если ПриборУчета = Неопределено Тогда
		Запрос.УстановитьПараметр("ТочкиУчета"	, Объект.ТочкиУчета.Выгрузить());
	Иначе 
		Запрос.УстановитьПараметр("ТочкиУчета"	, Объект.ТочкиУчета.Выгрузить(Новый Структура("ПриборУчета", ПриборУчета)));
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТУ = Объект.ТочкиУчета[Выборка.НомерСтроки - 1];
		ЗаполнитьЗначенияСвойств(СтрокаТУ, Выборка,,"НомерСтроки");
	КонецЦикла;
	
КонецПроцедуры
// Конец МенюОтчеты

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПриборыУчетаСервер(ИдентификаторСтроки = Неопределено, ТочкаУчета = Неопределено)
	Если ИдентификаторСтроки = Неопределено Тогда
		ТаблицаТЧ 									= Объект.ПоказанияПриборовУчета.Выгрузить();
		Объект.ШкалыПриборовУчета.Очистить();
		Объект.ПоказанияПриборовУчета.Очистить();
		Объект.ТочкиУчета.Очистить();
	Иначе
		СтрокаТочкиУчета  							= Объект.ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
		ТочкаУчета 									= СтрокаТочкиУчета.ТочкаУчета;
		ПоискШкал	 								= Новый Структура("IDСтрокиТочкиУчета",СтрокаТочкиУчета.IDСтроки);
		СтрокиШкал  								= Объект.ШкалыПриборовУчета.НайтиСтроки(ПоискШкал);
		Для Каждого СтрокаШкалы Из СтрокиШкал Цикл
			ПоискПоказаний 							= Новый Структура("IDСтроки", СтрокаШкалы.IDСтроки);
			СтрокиПоказаний 						= Объект.ПоказанияПриборовУчета.НайтиСтроки(ПоискПоказаний);
			Для Каждого СтрокаПоказаний Из СтрокиПоказаний Цикл
				Объект.ПоказанияПриборовУчета.Удалить(СтрокаПоказаний);
			КонецЦикла;
			Объект.ШкалыПриборовУчета.Удалить(СтрокаШкалы);
		КонецЦикла;		
	КонецЕсли;

	Результат 										= энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПомещения(Объект.Дата,Объект.Организация,Объект.Район,Объект.КлючПомещения, ТочкаУчета); 
	Выборка  										= Результат.выбрать();
	ТекТочкаУчета 									= Неопределено;
	ТекШкала 										= Неопределено;
	IDСтрокиТочки 									= Неопределено;
	IDСтрокиШкалы 									= Неопределено;
	Пока Выборка.следующий() цикл
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			Если ИдентификаторСтроки = Неопределено Тогда
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
				IDСтрокиТочки 						= Новый УникальныйИдентификатор;
				СтрокаТочкиУчета.IDСтроки			= IDСтрокиТочки;
				СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			иначе 				
				СтрокаТочкиУчета  					= Объект.ТочкиУчета.НайтиПоИдентификатору(ИдентификаторСтроки);
				IDСтрокиТочки 						= СтрокаТочкиУчета.IDСтроки;
			КонецЕсли;
			СтрокаТочкиУчета.Услуга 				= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета            = Выборка.ПриборУчета;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПриборУчета) Тогда
			Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета ИЛИ НЕ ТекШкала = Выборка.Шкала Тогда
				СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
				IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
				СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
				СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
				СтрокаШкалы.Шкала 					= Выборка.Шкала;
				СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
			КонецЕсли;
			
			СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
			СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
			СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		КонецЕсли;
		
		ТекТочкаУчета 								= Выборка.ТочкаУчета;
		ТекШкала 									= Выборка.Шкала;
	КонецЦикла; 
	
	ПолучитьДатуПредыдущейПоверкиПУНаСервере();
	
	СоответствиеКолонок 							= Новый Структура;
	СоответствиеКолонок.Вставить("ПриборУчета"	,"ПриборУчета");
	СоответствиеКолонок.Вставить("IDСтроки"		,"IDСтроки");
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район,Объект.КлючПомещения,ИдентификаторСтроки,СоответствиеКолонок); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация,ТаблицаПоказанийДляЗаполнения,Объект.Дата);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
			
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКлючаПомещения(Знач ДанныеПомещенияРезультат)
	
	Перем ДанныеПомещенияВыборка;
	
	Если Не ДанныеПомещенияРезультат.Пустой() Тогда
		ДанныеПомещенияВыборка  = ДанныеПомещенияРезультат.Выбрать();
		ДанныеПомещенияВыборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ДанныеПомещенияВыборка,"Строение,Помещение,ЧастныйСектор");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
